{
  "job_title": "Data Scientist",
  "technical_questions": [
    {
      "category": "Python and Data Manipulation",
      "question": "Explain how you would use Pandas and NumPy to handle missing data in a dataset.",
      "difficulty": "medium",
      "follow_up": "What are the pros and cons of different methods for handling missing data?"
    },
    {
      "category": "Machine Learning Concepts",
      "question": "What are the key differences between supervised and unsupervised learning?",
      "difficulty": "medium",
      "follow_up": "Can you provide an example of a real-world problem for each type of learning?"
    },
    {
      "category": "Statistics and Probability",
      "question": "How would you explain the concept of overfitting in machine learning?",
      "difficulty": "medium",
      "follow_up": "What techniques can be used to prevent overfitting?"
    },
    {
      "category": "SQL and Data Manipulation",
      "question": "Describe how you would optimize a SQL query to improve performance.",
      "difficulty": "medium",
      "follow_up": "What factors would you consider when indexing a database table?"
    },
    {
      "category": "Data Visualization",
      "question": "What factors would you consider when choosing between Power BI and Tableau for a project?",
      "difficulty": "medium",
      "follow_up": "How would you ensure that your visualizations effectively communicate the intended insights?"
    },
    {
      "category": "Cloud Platforms",
      "question": "Explain the benefits of using cloud platforms like AWS or Azure for data science projects.",
      "difficulty": "medium",
      "follow_up": "What are some challenges you might face when deploying machine learning models on the cloud?"
    }
  ],
  "project_questions": [
    {
      "project": "Tap-in – Conference Event Management Platform",
      "question": "Describe the architecture you used for developing the Tap-in platform.",
      "follow_up": "What were the main challenges you faced in integrating secure registration and payments?"
    },
    {
      "project": "Invoice Processing Automation",
      "question": "What was your approach to training and fine-tuning models for invoice processing?",
      "follow_up": "How did you integrate the ML pipelines with backend services?"
    },
    {
      "project": "Medical Inventory Automation",
      "question": "Explain the decision-making process behind using PaddleOCR and LayoutParser for this project.",
      "follow_up": "What were the key factors that contributed to achieving 98% field extraction accuracy?"
    }
  ],
  "behavioral_questions": [
    {
      "category": "Problem-solving",
      "question": "Describe a time when you faced a significant technical challenge. How did you approach solving it?",
      "context": "Ask when discussing past project experiences."
    },
    {
      "category": "Teamwork",
      "question": "Can you provide an example of how you collaborated with a team to achieve a project goal?",
      "context": "Ask when exploring experiences working in cross-functional teams."
    },
    {
      "category": "Adaptability",
      "question": "Tell me about a situation where you had to learn a new technology quickly. How did you manage it?",
      "context": "Ask when discussing the candidate's ability to adapt to new environments."
    }
  ]
}