{
  "technical_questions": [
    {
      "category": "Generative AI",
      "question": "Explain the concept of Generative AI and how it differs from traditional AI approaches.",
      "difficulty": "medium",
      "follow_up": "What are some real-world applications of Generative AI that you find particularly interesting?"
    },
    {
      "category": "Python and Data Engineering",
      "question": "What are the key differences between using Pandas and PySpark for data processing?",
      "difficulty": "medium",
      "follow_up": "In what scenarios would you choose one over the other?"
    },
    {
      "category": "Cloud Platforms",
      "question": "Describe how you would design a data pipeline using Databricks on a cloud platform like AWS or Azure.",
      "difficulty": "hard",
      "follow_up": "What are the benefits of using Databricks for data engineering tasks?"
    },
    {
      "category": "RESTful APIs",
      "question": "What are the essential components of a RESTful API, and why are they important?",
      "difficulty": "medium",
      "follow_up": "How would you ensure the security of a RESTful API?"
    },
    {
      "category": "Agile and DevOps Practices",
      "question": "How do Agile and DevOps practices complement each other in software development?",
      "difficulty": "medium",
      "follow_up": "Can you describe a scenario where you successfully implemented these practices?"
    },
    {
      "category": "Data Governance",
      "question": "What are some best practices for maintaining data quality and governance in AI solutions?",
      "difficulty": "hard",
      "follow_up": "How do you ensure compliance with data privacy regulations in your projects?"
    }
  ],
  "project_questions": [
    {
      "project": "Low-latency voice bot for candidate screening",
      "question": "What were the main considerations when designing the architecture for the voice bot?",
      "follow_up": "How did you ensure real-time communication and low latency in your solution?"
    },
    {
      "project": "Conference Event Management Platform",
      "question": "Describe the architecture you used for the event management platform and why you chose it.",
      "follow_up": "What challenges did you face with secure registration and payment processing, and how did you address them?"
    },
    {
      "project": "Invoice Processing Automation",
      "question": "What role did AI play in the invoice processing automation project?",
      "follow_up": "How did you handle the extraction and processing of unstructured data in this project?"
    }
  ],
  "behavioral_questions": [
    {
      "category": "Teamwork",
      "question": "Describe a time when you had to work closely with a team to achieve a project goal. What was your role, and how did you contribute to the team's success?",
      "context": "Ask when discussing collaborative projects or team-based work environments."
    },
    {
      "category": "Problem-solving",
      "question": "Can you provide an example of a complex problem you faced in a project and how you approached solving it?",
      "context": "Ask when exploring the candidate's problem-solving skills and adaptability."
    },
    {
      "category": "Leadership",
      "question": "Have you ever taken a leadership role in a project? How did you manage the team and ensure the project's success?",
      "context": "Ask when assessing leadership potential or past leadership experience."
    }
  ]
}